yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_ppb.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_ppb.h
 *
 * Generated from rp2040.svd originally provided by
 *   Raspberry Pi (Trading) Ltd.
 *
 * Copyright 2020 (c) 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_PPB_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_PPB_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_PPB_SYST_CSR_OFFSET    0x00e010  /* Use the SysTick Control and Status Register to enable the SysTick features. */
#define RP2040_PPB_SYST_RVR_OFFSET    0x00e014  /* Use the SysTick Reload Value Register to specify the start value to load into the current value register when the counter reaches 0. It can be any value between 0 and 0x00FFFFFF. A start value of 0 is possible, but has no effect because the SysTick interrupt and COUNTFLAG are activated when counting from 1 to 0. The reset value of this register is UNKNOWN. To generate a multi-shot timer with a period of N processor clock cycles, use a RELOAD value of N-1. For example, if the SysTick interrupt is required every 100 clock pulses, set RELOAD to 99. */
#define RP2040_PPB_SYST_CVR_OFFSET    0x00e018  /* Use the SysTick Current Value Register to find the current value in the register. The reset value of this register is UNKNOWN. */
#define RP2040_PPB_SYST_CALIB_OFFSET  0x00e01c  /* Use the SysTick Calibration Value Register to enable software to scale to any required speed using divide and multiply. */
#define RP2040_PPB_NVIC_ISER_OFFSET   0x00e100  /* Use the Interrupt Set-Enable Register to enable interrupts and determine which interrupts are currently enabled. If a pending interrupt is enabled, the NVIC activates the interrupt based on its priority. If an interrupt is not enabled, asserting its interrupt signal changes the interrupt state to pending, but the NVIC never activates the interrupt, regardless of its priority. */
#define RP2040_PPB_NVIC_ICER_OFFSET   0x00e180  /* Use the Interrupt Clear-Enable Registers to disable interrupts and determine which interrupts are currently enabled. */
#define RP2040_PPB_NVIC_ISPR_OFFSET   0x00e200  /* The NVIC_ISPR forces interrupts into the pending state, and shows which interrupts are pending. */
#define RP2040_PPB_NVIC_ICPR_OFFSET   0x00e280  /* Use the Interrupt Clear-Pending Register to clear pending interrupts and determine which interrupts are currently pending. */
#define RP2040_PPB_NVIC_IPR0_OFFSET   0x00e400  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. Note: Writing 1 to an NVIC_ICPR bit does not affect the active state of the corresponding interrupt. These registers are only word-accessible */
#define RP2040_PPB_NVIC_IPR1_OFFSET   0x00e404  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR2_OFFSET   0x00e408  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR3_OFFSET   0x00e40c  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR4_OFFSET   0x00e410  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR5_OFFSET   0x00e414  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR6_OFFSET   0x00e418  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_NVIC_IPR7_OFFSET   0x00e41c  /* Use the Interrupt Priority Registers to assign a priority from 0 to 3 to each of the available interrupts. 0 is the highest priority, and 3 is the lowest. */
#define RP2040_PPB_CPUID_OFFSET       0x00ed00  /* Read the CPU ID Base Register to determine: the ID number of the processor core, the version number of the processor core, the implementation details of the processor core. */
#define RP2040_PPB_ICSR_OFFSET        0x00ed04  /* Use the Interrupt Control State Register to set a pending Non-Maskable Interrupt (NMI), set or clear a pending PendSV, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, check the vector number of the active exception. */
#define RP2040_PPB_VTOR_OFFSET        0x00ed08  /* The VTOR holds the vector table offset address. */
#define RP2040_PPB_AIRCR_OFFSET       0x00ed0c  /* Use the Application Interrupt and Reset Control Register to: determine data endianness, clear all active state information from debug halt mode, request a system reset. */
#define RP2040_PPB_SCR_OFFSET         0x00ed10  /* System Control Register. Use the System Control Register for power-management functions: signal to the system when the processor can enter a low power state, control how the processor enters and exits low power states. */
#define RP2040_PPB_CCR_OFFSET         0x00ed14  /* The Configuration and Control Register permanently enables stack alignment and causes unaligned accesses to result in a Hard Fault. */
#define RP2040_PPB_SHPR2_OFFSET       0x00ed1c  /* System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 2 to set the priority of SVCall. */
#define RP2040_PPB_SHPR3_OFFSET       0x00ed20  /* System handlers are a special class of exception handler that can have their priority set to any of the priority levels. Use the System Handler Priority Register 3 to set the priority of PendSV and SysTick. */
#define RP2040_PPB_SHCSR_OFFSET       0x00ed24  /* Use the System Handler Control and State Register to determine or clear the pending status of SVCall. */
#define RP2040_PPB_MPU_TYPE_OFFSET    0x00ed90  /* Read the MPU Type Register to determine if the processor implements an MPU, and how many regions the MPU supports. */
#define RP2040_PPB_MPU_CTRL_OFFSET    0x00ed94  /* Use the MPU Control Register to enable and disable the MPU, and to control whether the default memory map is enabled as a background region for privileged accesses, and whether the MPU is enabled for HardFaults and NMIs. */
#define RP2040_PPB_MPU_RNR_OFFSET     0x00ed98  /* Use the MPU Region Number Register to select the region currently accessed by MPU_RBAR and MPU_RASR. */
#define RP2040_PPB_MPU_RBAR_OFFSET    0x00ed9c  /* Read the MPU Region Base Address Register to determine the base address of the region identified by MPU_RNR. Write to update the base address of said region or that of a specified region, with whose number MPU_RNR will also be updated. */
#define RP2040_PPB_MPU_RASR_OFFSET    0x00eda0  /* Use the MPU Region Attribute and Size Register to define the size, access behaviour and memory type of the region identified by MPU_RNR, and enable that region. */

/* Register definitions *****************************************************/

#define RP2040_PPB_SYST_CSR    (RP2040_PPB_BASE + RP2040_PPB_SYST_CSR_OFFSET)
#define RP2040_PPB_SYST_RVR    (RP2040_PPB_BASE + RP2040_PPB_SYST_RVR_OFFSET)
#define RP2040_PPB_SYST_CVR    (RP2040_PPB_BASE + RP2040_PPB_SYST_CVR_OFFSET)
#define RP2040_PPB_SYST_CALIB  (RP2040_PPB_BASE + RP2040_PPB_SYST_CALIB_OFFSET)
#define RP2040_PPB_NVIC_ISER   (RP2040_PPB_BASE + RP2040_PPB_NVIC_ISER_OFFSET)
#define RP2040_PPB_NVIC_ICER   (RP2040_PPB_BASE + RP2040_PPB_NVIC_ICER_OFFSET)
#define RP2040_PPB_NVIC_ISPR   (RP2040_PPB_BASE + RP2040_PPB_NVIC_ISPR_OFFSET)
#define RP2040_PPB_NVIC_ICPR   (RP2040_PPB_BASE + RP2040_PPB_NVIC_ICPR_OFFSET)
#define RP2040_PPB_NVIC_IPR0   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR0_OFFSET)
#define RP2040_PPB_NVIC_IPR1   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR1_OFFSET)
#define RP2040_PPB_NVIC_IPR2   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR2_OFFSET)
#define RP2040_PPB_NVIC_IPR3   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR3_OFFSET)
#define RP2040_PPB_NVIC_IPR4   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR4_OFFSET)
#define RP2040_PPB_NVIC_IPR5   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR5_OFFSET)
#define RP2040_PPB_NVIC_IPR6   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR6_OFFSET)
#define RP2040_PPB_NVIC_IPR7   (RP2040_PPB_BASE + RP2040_PPB_NVIC_IPR7_OFFSET)
#define RP2040_PPB_CPUID       (RP2040_PPB_BASE + RP2040_PPB_CPUID_OFFSET)
#define RP2040_PPB_ICSR        (RP2040_PPB_BASE + RP2040_PPB_ICSR_OFFSET)
#define RP2040_PPB_VTOR        (RP2040_PPB_BASE + RP2040_PPB_VTOR_OFFSET)
#define RP2040_PPB_AIRCR       (RP2040_PPB_BASE + RP2040_PPB_AIRCR_OFFSET)
#define RP2040_PPB_SCR         (RP2040_PPB_BASE + RP2040_PPB_SCR_OFFSET)
#define RP2040_PPB_CCR         (RP2040_PPB_BASE + RP2040_PPB_CCR_OFFSET)
#define RP2040_PPB_SHPR2       (RP2040_PPB_BASE + RP2040_PPB_SHPR2_OFFSET)
#define RP2040_PPB_SHPR3       (RP2040_PPB_BASE + RP2040_PPB_SHPR3_OFFSET)
#define RP2040_PPB_SHCSR       (RP2040_PPB_BASE + RP2040_PPB_SHCSR_OFFSET)
#define RP2040_PPB_MPU_TYPE    (RP2040_PPB_BASE + RP2040_PPB_MPU_TYPE_OFFSET)
#define RP2040_PPB_MPU_CTRL    (RP2040_PPB_BASE + RP2040_PPB_MPU_CTRL_OFFSET)
#define RP2040_PPB_MPU_RNR     (RP2040_PPB_BASE + RP2040_PPB_MPU_RNR_OFFSET)
#define RP2040_PPB_MPU_RBAR    (RP2040_PPB_BASE + RP2040_PPB_MPU_RBAR_OFFSET)
#define RP2040_PPB_MPU_RASR    (RP2040_PPB_BASE + RP2040_PPB_MPU_RASR_OFFSET)

/* Register bit definitions *************************************************/

#define RP2040_PPB_SYST_CSR_COUNTFLAG        (1 << 16)  /* Returns 1 if timer counted to 0 since last time this was read. Clears on read by application or debugger. */
#define RP2040_PPB_SYST_CSR_CLKSOURCE        (1 << 2)  /* SysTick clock source. Always reads as one if SYST_CALIB reports NOREF. Selects the SysTick timer clock source: 0 = External reference clock. 1 = Processor clock. */
#define RP2040_PPB_SYST_CSR_TICKINT          (1 << 1)  /* Enables SysTick exception request: 0 = Counting down to zero does not assert the SysTick exception request. 1 = Counting down to zero to asserts the SysTick exception request. */
#define RP2040_PPB_SYST_CSR_ENABLE           (1 << 0)  /* Enable SysTick counter: 0 = Counter disabled. 1 = Counter enabled. */

#define RP2040_PPB_SYST_RVR_RELOAD_MASK      (0xffffff)  /* Value to load into the SysTick Current Value Register when the counter reaches 0. */

