yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_ppb.h
#define RP2040_PPB_SYST_CVR_CURRENT_MASK     (0xffffff)  /* Reads return the current value of the SysTick counter. This register is write-clear. Writing to it with any value clears the register to 0. Clearing this register also clears the COUNTFLAG bit of the SysTick Control and Status Register. */

#define RP2040_PPB_SYST_CALIB_NOREF          (1 << 31)  /* If reads as 1, the Reference clock is not provided - the CLKSOURCE bit of the SysTick Control and Status register will be forced to 1 and cannot be cleared to 0. */
#define RP2040_PPB_SYST_CALIB_SKEW           (1 << 30)  /* If reads as 1, the calibration value for 10ms is inexact (due to clock frequency). */
#define RP2040_PPB_SYST_CALIB_TENMS_MASK     (0xffffff)  /* An optional Reload value to be used for 10ms (100Hz) timing, subject to system clock skew errors. If the value reads as 0, the calibration value is not known. */

#define RP2040_PPB_NVIC_IPR0_IP_3_SHIFT      (30)  /* Priority of interrupt 3 */
#define RP2040_PPB_NVIC_IPR0_IP_3_MASK       (0x03 << RP2040_PPB_NVIC_IPR0_IP_3_SHIFT)
#define RP2040_PPB_NVIC_IPR0_IP_2_SHIFT      (22)  /* Priority of interrupt 2 */
#define RP2040_PPB_NVIC_IPR0_IP_2_MASK       (0x03 << RP2040_PPB_NVIC_IPR0_IP_2_SHIFT)
#define RP2040_PPB_NVIC_IPR0_IP_1_SHIFT      (14)  /* Priority of interrupt 1 */
#define RP2040_PPB_NVIC_IPR0_IP_1_MASK       (0x03 << RP2040_PPB_NVIC_IPR0_IP_1_SHIFT)
#define RP2040_PPB_NVIC_IPR0_IP_0_SHIFT      (6)  /* Priority of interrupt 0 */
#define RP2040_PPB_NVIC_IPR0_IP_0_MASK       (0x03 << RP2040_PPB_NVIC_IPR0_IP_0_SHIFT)

#define RP2040_PPB_NVIC_IPR1_IP_7_SHIFT      (30)  /* Priority of interrupt 7 */
#define RP2040_PPB_NVIC_IPR1_IP_7_MASK       (0x03 << RP2040_PPB_NVIC_IPR1_IP_7_SHIFT)
#define RP2040_PPB_NVIC_IPR1_IP_6_SHIFT      (22)  /* Priority of interrupt 6 */
#define RP2040_PPB_NVIC_IPR1_IP_6_MASK       (0x03 << RP2040_PPB_NVIC_IPR1_IP_6_SHIFT)
#define RP2040_PPB_NVIC_IPR1_IP_5_SHIFT      (14)  /* Priority of interrupt 5 */
#define RP2040_PPB_NVIC_IPR1_IP_5_MASK       (0x03 << RP2040_PPB_NVIC_IPR1_IP_5_SHIFT)
#define RP2040_PPB_NVIC_IPR1_IP_4_SHIFT      (6)  /* Priority of interrupt 4 */
#define RP2040_PPB_NVIC_IPR1_IP_4_MASK       (0x03 << RP2040_PPB_NVIC_IPR1_IP_4_SHIFT)

#define RP2040_PPB_NVIC_IPR2_IP_11_SHIFT     (30)  /* Priority of interrupt 11 */
#define RP2040_PPB_NVIC_IPR2_IP_11_MASK      (0x03 << RP2040_PPB_NVIC_IPR2_IP_11_SHIFT)
#define RP2040_PPB_NVIC_IPR2_IP_10_SHIFT     (22)  /* Priority of interrupt 10 */
#define RP2040_PPB_NVIC_IPR2_IP_10_MASK      (0x03 << RP2040_PPB_NVIC_IPR2_IP_10_SHIFT)
#define RP2040_PPB_NVIC_IPR2_IP_9_SHIFT      (14)  /* Priority of interrupt 9 */
#define RP2040_PPB_NVIC_IPR2_IP_9_MASK       (0x03 << RP2040_PPB_NVIC_IPR2_IP_9_SHIFT)
#define RP2040_PPB_NVIC_IPR2_IP_8_SHIFT      (6)  /* Priority of interrupt 8 */
#define RP2040_PPB_NVIC_IPR2_IP_8_MASK       (0x03 << RP2040_PPB_NVIC_IPR2_IP_8_SHIFT)

#define RP2040_PPB_NVIC_IPR3_IP_15_SHIFT     (30)  /* Priority of interrupt 15 */
#define RP2040_PPB_NVIC_IPR3_IP_15_MASK      (0x03 << RP2040_PPB_NVIC_IPR3_IP_15_SHIFT)
#define RP2040_PPB_NVIC_IPR3_IP_14_SHIFT     (22)  /* Priority of interrupt 14 */
#define RP2040_PPB_NVIC_IPR3_IP_14_MASK      (0x03 << RP2040_PPB_NVIC_IPR3_IP_14_SHIFT)
#define RP2040_PPB_NVIC_IPR3_IP_13_SHIFT     (14)  /* Priority of interrupt 13 */
#define RP2040_PPB_NVIC_IPR3_IP_13_MASK      (0x03 << RP2040_PPB_NVIC_IPR3_IP_13_SHIFT)
#define RP2040_PPB_NVIC_IPR3_IP_12_SHIFT     (6)  /* Priority of interrupt 12 */
#define RP2040_PPB_NVIC_IPR3_IP_12_MASK      (0x03 << RP2040_PPB_NVIC_IPR3_IP_12_SHIFT)

#define RP2040_PPB_NVIC_IPR4_IP_19_SHIFT     (30)  /* Priority of interrupt 19 */
#define RP2040_PPB_NVIC_IPR4_IP_19_MASK      (0x03 << RP2040_PPB_NVIC_IPR4_IP_19_SHIFT)
#define RP2040_PPB_NVIC_IPR4_IP_18_SHIFT     (22)  /* Priority of interrupt 18 */
#define RP2040_PPB_NVIC_IPR4_IP_18_MASK      (0x03 << RP2040_PPB_NVIC_IPR4_IP_18_SHIFT)
#define RP2040_PPB_NVIC_IPR4_IP_17_SHIFT     (14)  /* Priority of interrupt 17 */
#define RP2040_PPB_NVIC_IPR4_IP_17_MASK      (0x03 << RP2040_PPB_NVIC_IPR4_IP_17_SHIFT)
#define RP2040_PPB_NVIC_IPR4_IP_16_SHIFT     (6)  /* Priority of interrupt 16 */
#define RP2040_PPB_NVIC_IPR4_IP_16_MASK      (0x03 << RP2040_PPB_NVIC_IPR4_IP_16_SHIFT)

#define RP2040_PPB_NVIC_IPR5_IP_23_SHIFT     (30)  /* Priority of interrupt 23 */
#define RP2040_PPB_NVIC_IPR5_IP_23_MASK      (0x03 << RP2040_PPB_NVIC_IPR5_IP_23_SHIFT)
#define RP2040_PPB_NVIC_IPR5_IP_22_SHIFT     (22)  /* Priority of interrupt 22 */
#define RP2040_PPB_NVIC_IPR5_IP_22_MASK      (0x03 << RP2040_PPB_NVIC_IPR5_IP_22_SHIFT)
#define RP2040_PPB_NVIC_IPR5_IP_21_SHIFT     (14)  /* Priority of interrupt 21 */
#define RP2040_PPB_NVIC_IPR5_IP_21_MASK      (0x03 << RP2040_PPB_NVIC_IPR5_IP_21_SHIFT)
#define RP2040_PPB_NVIC_IPR5_IP_20_SHIFT     (6)  /* Priority of interrupt 20 */
#define RP2040_PPB_NVIC_IPR5_IP_20_MASK      (0x03 << RP2040_PPB_NVIC_IPR5_IP_20_SHIFT)

#define RP2040_PPB_NVIC_IPR6_IP_27_SHIFT     (30)  /* Priority of interrupt 27 */
#define RP2040_PPB_NVIC_IPR6_IP_27_MASK      (0x03 << RP2040_PPB_NVIC_IPR6_IP_27_SHIFT)
#define RP2040_PPB_NVIC_IPR6_IP_26_SHIFT     (22)  /* Priority of interrupt 26 */
#define RP2040_PPB_NVIC_IPR6_IP_26_MASK      (0x03 << RP2040_PPB_NVIC_IPR6_IP_26_SHIFT)
#define RP2040_PPB_NVIC_IPR6_IP_25_SHIFT     (14)  /* Priority of interrupt 25 */
#define RP2040_PPB_NVIC_IPR6_IP_25_MASK      (0x03 << RP2040_PPB_NVIC_IPR6_IP_25_SHIFT)
#define RP2040_PPB_NVIC_IPR6_IP_24_SHIFT     (6)  /* Priority of interrupt 24 */
#define RP2040_PPB_NVIC_IPR6_IP_24_MASK      (0x03 << RP2040_PPB_NVIC_IPR6_IP_24_SHIFT)

#define RP2040_PPB_NVIC_IPR7_IP_31_SHIFT     (30)  /* Priority of interrupt 31 */
#define RP2040_PPB_NVIC_IPR7_IP_31_MASK      (0x03 << RP2040_PPB_NVIC_IPR7_IP_31_SHIFT)
#define RP2040_PPB_NVIC_IPR7_IP_30_SHIFT     (22)  /* Priority of interrupt 30 */
#define RP2040_PPB_NVIC_IPR7_IP_30_MASK      (0x03 << RP2040_PPB_NVIC_IPR7_IP_30_SHIFT)
#define RP2040_PPB_NVIC_IPR7_IP_29_SHIFT     (14)  /* Priority of interrupt 29 */
#define RP2040_PPB_NVIC_IPR7_IP_29_MASK      (0x03 << RP2040_PPB_NVIC_IPR7_IP_29_SHIFT)
#define RP2040_PPB_NVIC_IPR7_IP_28_SHIFT     (6)  /* Priority of interrupt 28 */
#define RP2040_PPB_NVIC_IPR7_IP_28_MASK      (0x03 << RP2040_PPB_NVIC_IPR7_IP_28_SHIFT)

