yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_ppb.h
#define RP2040_PPB_CPUID_IMPLEMENTER_SHIFT   (24)  /* Implementor code: 0x41 = ARM */
#define RP2040_PPB_CPUID_IMPLEMENTER_MASK    (0xff << RP2040_PPB_CPUID_IMPLEMENTER_SHIFT)
#define RP2040_PPB_CPUID_VARIANT_SHIFT       (20)  /* Major revision number n in the rnpm revision status: 0x0 = Revision 0. */
#define RP2040_PPB_CPUID_VARIANT_MASK        (0x0f << RP2040_PPB_CPUID_VARIANT_SHIFT)
#define RP2040_PPB_CPUID_ARCHITECTURE_SHIFT  (16)  /* Constant that defines the architecture of the processor: 0xC = ARMv6-M architecture. */
#define RP2040_PPB_CPUID_ARCHITECTURE_MASK   (0x0f << RP2040_PPB_CPUID_ARCHITECTURE_SHIFT)
#define RP2040_PPB_CPUID_PARTNO_SHIFT        (4)  /* Number of processor within family: 0xC60 = Cortex-M0+ */
#define RP2040_PPB_CPUID_PARTNO_MASK         (0xfff << RP2040_PPB_CPUID_PARTNO_SHIFT)
#define RP2040_PPB_CPUID_REVISION_MASK       (0x0f)  /* Minor revision number m in the rnpm revision status: 0x1 = Patch 1. */

#define RP2040_PPB_ICSR_NMIPENDSET           (1 << 31)  /* Setting this bit will activate an NMI. Since NMI is the highest priority exception, it will activate as soon as it is registered. NMI set-pending bit. Write: 0 = No effect. 1 = Changes NMI exception state to pending. Read: 0 = NMI exception is not pending. 1 = NMI exception is pending. Because NMI is the highest-priority exception, normally the processor enters the NMI exception handler as soon as it detects a write of 1 to this bit. Entering the handler then clears this bit to 0. This means a read of this bit by the NMI exception handler returns 1 only if the NMI signal is reasserted while the processor is executing that handler. */
#define RP2040_PPB_ICSR_PENDSVSET            (1 << 28)  /* PendSV set-pending bit. Write: 0 = No effect. 1 = Changes PendSV exception state to pending. Read: 0 = PendSV exception is not pending. 1 = PendSV exception is pending. Writing 1 to this bit is the only way to set the PendSV exception state to pending. */
#define RP2040_PPB_ICSR_PENDSVCLR            (1 << 27)  /* PendSV clear-pending bit. Write: 0 = No effect. 1 = Removes the pending state from the PendSV exception. */
#define RP2040_PPB_ICSR_PENDSTSET            (1 << 26)  /* SysTick exception set-pending bit. Write: 0 = No effect. 1 = Changes SysTick exception state to pending. Read: 0 = SysTick exception is not pending. 1 = SysTick exception is pending. */
#define RP2040_PPB_ICSR_PENDSTCLR            (1 << 25)  /* SysTick exception clear-pending bit. Write: 0 = No effect. 1 = Removes the pending state from the SysTick exception. This bit is WO. On a register read its value is Unknown. */
#define RP2040_PPB_ICSR_ISRPREEMPT           (1 << 23)  /* The system can only access this bit when the core is halted. It indicates that a pending interrupt is to be taken in the next running cycle. If C_MASKINTS is clear in the Debug Halting Control and Status Register, the interrupt is serviced. */
#define RP2040_PPB_ICSR_ISRPENDING           (1 << 22)  /* External interrupt pending flag */
#define RP2040_PPB_ICSR_VECTPENDING_SHIFT    (12)  /* Indicates the exception number for the highest priority pending exception: 0 = no pending exceptions. Non zero = The pending state includes the effect of memory-mapped enable and mask registers. It does not include the PRIMASK special-purpose register qualifier. */
#define RP2040_PPB_ICSR_VECTPENDING_MASK     (0x1ff << RP2040_PPB_ICSR_VECTPENDING_SHIFT)
#define RP2040_PPB_ICSR_VECTACTIVE_MASK      (0x1ff)  /* Active exception number field. Reset clears the VECTACTIVE field. */

#define RP2040_PPB_VTOR_TBLOFF_SHIFT         (8)  /* Bits [31:8] of the indicate the vector table offset address. */
#define RP2040_PPB_VTOR_TBLOFF_MASK          (0xffffff << RP2040_PPB_VTOR_TBLOFF_SHIFT)

#define RP2040_PPB_AIRCR_VECTKEY_SHIFT       (16)  /* Register key: Reads as Unknown On writes, write 0x05FA to VECTKEY, otherwise the write is ignored. */
#define RP2040_PPB_AIRCR_VECTKEY_MASK        (0xffff << RP2040_PPB_AIRCR_VECTKEY_SHIFT)
#define RP2040_PPB_AIRCR_ENDIANESS           (1 << 15)  /* Data endianness implemented: 0 = Little-endian. */
#define RP2040_PPB_AIRCR_SYSRESETREQ         (1 << 2)  /* Writing 1 to this bit causes the SYSRESETREQ signal to the outer system to be asserted to request a reset. The intention is to force a large system reset of all major components except for debug. The C_HALT bit in the DHCSR is cleared as a result of the system reset requested. The debugger does not lose contact with the device. */
#define RP2040_PPB_AIRCR_VECTCLRACTIVE       (1 << 1)  /* Clears all active state information for fixed and configurable exceptions. This bit: is self-clearing, can only be set by the DAP when the core is halted.  When set: clears all active exception status of the processor, forces a return to Thread mode, forces an IPSR of 0. A debugger must re-initialize the stack. */

#define RP2040_PPB_SCR_SEVONPEND             (1 << 4)  /* Send Event on Pending bit: 0 = Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded. 1 = Enabled events and all interrupts, including disabled interrupts, can wakeup the processor. When an event or interrupt becomes pending, the event signal wakes up the processor from WFE. If the processor is not waiting for an event, the event is registered and affects the next WFE. The processor also wakes up on execution of an SEV instruction or an external event. */
#define RP2040_PPB_SCR_SLEEPDEEP             (1 << 2)  /* Controls whether the processor uses sleep or deep sleep as its low power mode: 0 = Sleep. 1 = Deep sleep. */
#define RP2040_PPB_SCR_SLEEPONEXIT           (1 << 1)  /* Indicates sleep-on-exit when returning from Handler mode to Thread mode: 0 = Do not sleep when returning to Thread mode. 1 = Enter sleep, or deep sleep, on return from an ISR to Thread mode. Setting this bit to 1 enables an interrupt driven application to avoid returning to an empty main application. */

#define RP2040_PPB_CCR_STKALIGN              (1 << 9)  /* Always reads as one, indicates 8-byte stack alignment on exception entry. On exception entry, the processor uses bit[9] of the stacked PSR to indicate the stack alignment. On return from the exception it uses this stacked bit to restore the correct stack alignment. */
#define RP2040_PPB_CCR_UNALIGN_TRP           (1 << 3)  /* Always reads as one, indicates that all unaligned accesses generate a HardFault. */

#define RP2040_PPB_SHPR2_PRI_11_SHIFT        (30)  /* Priority of system handler 11, SVCall */
#define RP2040_PPB_SHPR2_PRI_11_MASK         (0x03 << RP2040_PPB_SHPR2_PRI_11_SHIFT)

#define RP2040_PPB_SHPR3_PRI_15_SHIFT        (30)  /* Priority of system handler 15, SysTick */
#define RP2040_PPB_SHPR3_PRI_15_MASK         (0x03 << RP2040_PPB_SHPR3_PRI_15_SHIFT)
#define RP2040_PPB_SHPR3_PRI_14_SHIFT        (22)  /* Priority of system handler 14, PendSV */
#define RP2040_PPB_SHPR3_PRI_14_MASK         (0x03 << RP2040_PPB_SHPR3_PRI_14_SHIFT)

