yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_ppb.h
#define RP2040_PPB_SHCSR_SVCALLPENDED        (1 << 15)  /* Reads as 1 if SVCall is Pending.  Write 1 to set pending SVCall, write 0 to clear pending SVCall. */

#define RP2040_PPB_MPU_TYPE_IREGION_SHIFT    (16)  /* Instruction region. Reads as zero as ARMv6-M only supports a unified MPU. */
#define RP2040_PPB_MPU_TYPE_IREGION_MASK     (0xff << RP2040_PPB_MPU_TYPE_IREGION_SHIFT)
#define RP2040_PPB_MPU_TYPE_DREGION_SHIFT    (8)  /* Number of regions supported by the MPU. */
#define RP2040_PPB_MPU_TYPE_DREGION_MASK     (0xff << RP2040_PPB_MPU_TYPE_DREGION_SHIFT)
#define RP2040_PPB_MPU_TYPE_SEPARATE         (1 << 0)  /* Indicates support for separate instruction and data address maps. Reads as 0 as ARMv6-M only supports a unified MPU. */

#define RP2040_PPB_MPU_CTRL_PRIVDEFENA       (1 << 2)  /* Controls whether the default memory map is enabled as a background region for privileged accesses. This bit is ignored when ENABLE is clear. 0 = If the MPU is enabled, disables use of the default memory map. Any memory access to a location not covered by any enabled region causes a fault. 1 = If the MPU is enabled, enables use of the default memory map as a background region for privileged software accesses. When enabled, the background region acts as if it is region number -1. Any region that is defined and enabled has priority over this default map. */
#define RP2040_PPB_MPU_CTRL_HFNMIENA         (1 << 1)  /* Controls the use of the MPU for HardFaults and NMIs. Setting this bit when ENABLE is clear results in UNPREDICTABLE behaviour. When the MPU is enabled: 0 = MPU is disabled during HardFault and NMI handlers, regardless of the value of the ENABLE bit. 1 = the MPU is enabled during HardFault and NMI handlers. */
#define RP2040_PPB_MPU_CTRL_ENABLE           (1 << 0)  /* Enables the MPU. If the MPU is disabled, privileged and unprivileged accesses use the default memory map. 0 = MPU disabled. 1 = MPU enabled. */

#define RP2040_PPB_MPU_RNR_REGION_MASK       (0x0f)  /* Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers. The MPU supports 8 memory regions, so the permitted values of this field are 0-7. */

#define RP2040_PPB_MPU_RBAR_ADDR_SHIFT       (8)  /* Base address of the region. */
#define RP2040_PPB_MPU_RBAR_ADDR_MASK        (0xffffff << RP2040_PPB_MPU_RBAR_ADDR_SHIFT)
#define RP2040_PPB_MPU_RBAR_VALID            (1 << 4)  /* On writes, indicates whether the write must update the base address of the region identified by the REGION field, updating the MPU_RNR to indicate this new region. Write: 0 = MPU_RNR not changed, and the processor: Updates the base address for the region specified in the MPU_RNR. Ignores the value of the REGION field. 1 = The processor: Updates the value of the MPU_RNR to the value of the REGION field. Updates the base address for the region specified in the REGION field. Always reads as zero. */
#define RP2040_PPB_MPU_RBAR_REGION_MASK      (0x0f)  /* On writes, specifies the number of the region whose base address to update provided VALID is set written as 1. On reads, returns bits [3:0] of MPU_RNR. */

#define RP2040_PPB_MPU_RASR_ATTRS_SHIFT      (16)  /* The MPU Region Attribute field. Use to define the region attribute control. 28 = XN: Instruction access disable bit: 0 = Instruction fetches enabled. 1 = Instruction fetches disabled. 26:24 = AP: Access permission field 18 = S: Shareable bit 17 = C: Cacheable bit 16 = B: Bufferable bit */
#define RP2040_PPB_MPU_RASR_ATTRS_MASK       (0xffff << RP2040_PPB_MPU_RASR_ATTRS_SHIFT)
#define RP2040_PPB_MPU_RASR_SRD_SHIFT        (8)  /* Subregion Disable. For regions of 256 bytes or larger, each bit of this field controls whether one of the eight equal subregions is enabled. */
#define RP2040_PPB_MPU_RASR_SRD_MASK         (0xff << RP2040_PPB_MPU_RASR_SRD_SHIFT)
#define RP2040_PPB_MPU_RASR_SIZE_SHIFT       (1)  /* Indicates the region size. Region size in bytes = 2^(SIZE+1). The minimum permitted value is 7 (b00111) = 256Bytes */
#define RP2040_PPB_MPU_RASR_SIZE_MASK        (0x1f << RP2040_PPB_MPU_RASR_SIZE_SHIFT)
#define RP2040_PPB_MPU_RASR_ENABLE           (1 << 0)  /* Enables the region. */

#endif /* __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_PPB_H */
